In [11]:
import pandas as pd
import numpy as np
import openpyxl

In [5]:
s = pd.Series([3,-5,7,4], index = ['a','b','c','d'])
#arithmetic operation
s.add(s)
s.sub(s)
s.div(s)
s.mul(s)

a     9
b    25
c    49
d    16
dtype: int64

In [19]:
data ={'country': ['belgium', 'India', 'France'],
       'Capital': ['Brussels','New dehli', 'Paris' ],
       'Population': [11190841, 1303171035, 2478475207]}
#convertung a dictionary into a dataframe
df = pd.DataFrame(data, columns=['country', 'Capital', 'Population'])

In [20]:
df

   country    Capital  Population
0  belgium   Brussels    11190841
1    India  New dehli  1303171035
2   France      Paris  2478475207

In [21]:
#read and write to csv
df.to_csv('mydataframe.csv', sep=',', encoding='utf-8-sig', index=False)
df.to_csv('mydataframe.txt', sep='\t', encoding='utf-8-sig', index=False)
pd.read_csv('mydataframe.csv', encoding='utf-8-sig')
pd.read_csv('mydataframe.csv', encoding='utf-8-sig', header=None, nrows=2)
pd.read_csv('mydataframe.txt', encoding='utf-8-sig', sep='\t')

   country    Capital  Population
0  belgium   Brussels    11190841
1    India  New dehli  1303171035
2   France      Paris  2478475207

In [22]:
# Fix the typo in the column name
df.columns = ['country', 'Capital', 'Population']

# Read and write into excel
df.to_excel('mydataframe.xlsx', sheet_name='Sheet1', index=False)
df_from_excel = pd.read_excel('mydataframe.xlsx', sheet_name='Sheet1')
df_from_excel

<ipython-input-22-b6e57e87666f>:5: UserWarning: Pandas requires version '1.4.3' or newer of 'xlsxwriter' (version '1.3.8' currently installed).
  df.to_excel('mydataframe.xlsx', sheet_name='Sheet1', index=False)

   country    Capital  Population
0  belgium   Brussels    11190841
1    India  New dehli  1303171035
2   France      Paris  2478475207

In [23]:
s['b']
df[1:]

  country    Capital  Population
1   India  New dehli  1303171035
2  France      Paris  2478475207